{"states":[
    {"type" : "State", "id" : "1", "name" : "Alabama", "population" :  4822023, "score" : 47, "guns" : 3439, "rank" : 82, "traces" : 71.32, "stateSummary" : "Alabama is not officially a Shall-Issue CCW state, but citizens are rarely turned down. Open carry is legal with some exceptions. There are no restrictions on MSRs or standard capacity magazines. Alabama has a Stand Your Ground law with no duty to retreat."},
    {"type" : "State", "id" : "2", "name" : "Alaska", "population" :  731449, "score" : 48, "guns" : 497, "rank" : 78, "traces" : 67.9473, "stateSummary" : "Alaska is one of only a handful of states that do not require a permit to carry a handgun concealed. It has the second highest percentage of gun owners per capita—58 percent—of any state in the Union, and has no other restrictions on gun owners or ownership. Alaska has no specific Castle Doctrine law, which is the only reason it did not score a perfect 50."},
    {"type" : "State", "id" : "3", "name" : "<Empty>", "population" :  0, "score" : 0, "guns" : 0, "rank" : 0, "traces" : 0, "stateSummary" : ""},
    {"type" : "State", "id" : "4", "name" : "Arizona", "population" :  6553255, "score" : 49, "guns" : 6279, "rank" : 98, "traces" : 95.81, "stateSummary" : "Arizona is the most recent “Constitutional Carry” state where no permit is required to carry a pistol openly or concealed. Anyone carrying concealed does NOT have to inform law enforcement unless that request comes during a lawful traffic or criminal investigation, arrest or detention or an investigatory stop by a law enforcement officer, and the State has no restrictions on MSRs or Class 3/NFA weapon ownership beyond the federal laws. Arizona has a Stand Your Ground law."},
    {"type" : "State", "id" : "5", "name" : "Arkansas", "population" :  2949131, "score" : 41, "guns" : 825, "rank" : 28, "traces" : 27.97, "stateSummary" : "While generally pro-gun and a Shall-Issue CCW state, open carry is not allowed. As far as self-defense/Castle Doctrine, the defender may have to retreat in some situations. The state has no restrictions on mag capacity or types of guns that are legal."},
    {"type" : "State", "id" : "6", "name" : "California", "population" :  38041430, "score" : 9, "guns" : 14694, "rank" : 48, "traces" : 38.63, "stateSummary" : "Where do I begin? The subjects of California are restricted to one handgun purchase per 30 days, have to live with magazine capacity restrictions and only handguns on the “approved” list are legal for sale in the state. While CCWs are technically legal, good luck trying getting one. There are so many restrictions on MSRs that their appearance is butchered. The state has a Castle Doctrine law, but it does not apply to cars or at work."},
    {"type" : "State", "id" : "7", "name" : "<Empty>", "population" :  0, "score" :  0, "guns" : 0, "rank" : 0, "traces" : 0, "stateSummary" : ""},
    {"type" : "State", "id" : "8", "name" : "Colorado", "population" :  5187582, "score" : 38, "guns" : 1528, "rank" : 32, "29.45" : 0, "stateSummary" : "Colorado is a Shall-Issue CCW state. There is a bill in the Colorado legislature to limit magazines to 15 rounds—among other things—so Magpul may be looking for a new home. Denver has an assault weapons law, but otherwise citizens are unfettered. They have a Castle Doctrine law, allowing defense of home. In addition, 35 percent of residents are gun owners, placing Colorado 33rd in the nation"},
    {"type" : "State", "id" : "9", "name" : "Connecticut", "population" :  3590347, "score" : 20, "guns" : 357, "rank" : 10, "traces" : 9.94, "stateSummary" : "While officially a May-Issue CCW state, Connecticut is a Shall-Issue state in practice—with a lot of requirements. An eligibility certificate is required to purchase a pistol. There are a number of restrictions on MSRs based on features—MSRs may be possessed provided they were purchased before Oct. 1, 1993, and the owner received a certificate of possession from the Connecticut State Police before July 1994, according to the NRA-ILA. As far as machine guns are concerned, the NRA writes, It is lawful to possess a machine gun in compliance with federal law, provided annual registration takes place with the state police. The state has a Castle Doctrine law that applies to residences. Connecticut is one of only a few states that has a law allowing for seizure of your weapons if the police just think you are a danger to yourself or others, and may keep the gun for up to a year. There are also plenty of laws circulating in local and state legislatures about guns due to the Sandy Hook shooting."},
    {"type" : "State", "id" : "10", "name" : "Delaware", "population" :  917092, "score" : 34, "guns" : 498, "rank" : 66, "traces" : 54.30, "stateSummary" : "Delaware is a May-Issue CCW state, but open carry is generally legal. Civilian ownership of Class 3 weapons allowed for research purposes only; otherwise, it is a felony. Delaware has no restrictions on MSRs or magazine capacity. There are no restrictions on defense of home, self, etc."},
    {"type" : "State", "id" : "11", "name" : "DC", "population" :  601723, "score" : 0, "guns" : 0, "rank" : 0, "traces" : 0, "stateSummary" : ""},
    {"type" : "State", "id" : "12", "name" : "Florida", "population" :  19317568, "score" : 46, "guns" : 13233, "rank" : 80, "traces" : 68.50, "stateSummary" : "Florida is a Shall-Issue CCW state and leader of the modern CCW movement; no disclosure to LE required. No open carry is allowed except when hunting/fishing. There are no restrictions on MSRs or magazine capacity. Florida has a Stand Your Ground law made famous in the Trayvon Martin case. Only 25 percent of Florida residents are gun owners."},
    {"type" : "State", "id" : "13", "name" : "Georgia", "population" :  9919945, "score" : 46, "guns" : 9287, "rank" : 96, "traces" : 93.62, "stateSummary" : "Georgia is a Shall-Issue CCW state, and allows concealed or open carry with a permit on your person or in your car. Georgia has a Stand Your Ground law. 40.3 percent of residents own guns, placing Georgia 25th in terms of gun ownership."},
    {"type" : "State", "id" : "14", "name" : "<Empty>", "population" :  0, "score" : 0, "guns" : 0, "rank" : 0, "traces" : 0, "stateSummary" : ""},
    {"type" : "State", "id" : "15", "name" : "Hawaii", "population" :  1392313, "score" : 10, "guns" : 55, "rank" : 1, "traces" : 3.95, "stateSummary" : "Hawaii is technically a May-Issue CCW state, but good luck trying to get one. A state permit to purchase is required to buy a handgun—some of which are prohibited. There are restrictions on assault weapons and any magazine that holds more than 10 rounds, and no Class 3/NFA weapons are allowed. The state has a Castle Doctrine law, but retreat is required outside the home. Hawaii has the lowest percentage of gun owners—6.7 percent—of all the states."},
    {"type" : "State", "id" : "16", "name" : "Idaho", "population" :  1595728, "score" : 40, "guns" : 709, "rank" : 56, "traces" : 44.43, "stateSummary" : "A Shall-Issue CCW state that recognizes CCWs from all other states—except Illinois, which does not issue. In Idaho, shootings may be justified if defending your home against tumultuous entry, and whether or not you have a duty to retreat is vague. Idaho has no restrictions on MSRs or mag capacity."},
    {"type" : "State", "id" : "17", "name" : "Illinois", "population" :  12875255, "score" : 21, "guns" : 4146, "rank" : 36, "traces" : 32.20, "stateSummary" : "As bad a reputation Illinois gets from gun owners—mostly due to Chicago—there are a lot of states that are worse. A FOID (Firearm Owner Identification) card is required to buy and/or own a gun. MSRs and standard capacity magazines are legal as long as you’re not in Chicago or Cook County. As far as Class 3/NFA weapons are concerned, AOWs are allowed, and as of Jan. 1, 2013, short-barreled rifles are allowed with a Curio and Relic (C&R) FFL. Illinois is currently the only state in the Union with no provision for concealed carry, though a recent court decision could change that this summer. Illinois has a Castle Doctrine with specific laws that prevent lawsuits being filed against a defender of dwelling, and no requirement for retreat."},
    {"type" : "State", "id" : "18", "name" : "Indiana", "population" :  6537334, "score" : 45, "guns" : 5207, "rank" : 92, "traces" : 79.65, "stateSummary" : "Indiana is a Shall-Issue CCW state. Class 3 weapons are legal in accordance with federal regulations, and there are no restrictions on MSRs or magazines. Indiana has a Castle Doctrine law with no duty to retreat, but it only covers private property. In terms of ownership, 39 percent of Indiana residents are gun owners, placing the state 27th in the nation."},
    {"type" : "State", "id" : "19", "name" : "Iowa", "population" :  3074186, "score" : 35, "guns" : 868, "rank" : 30, "traces" : 28.24, "stateSummary" : "Iowa is a Shall-Issue CCW state that allows concealed carry with a permit, for which training is required. Residents need a permit to purchase a pistol. There are no restrictions on MSRs or magazine capacity, but no NFA guns are allowed. The state boasts strong self-defense laws, with no duty to retreat in your home or business plus immunity from civil prosecution. Iowa ranks 16th in the nation in terms of ownership; 43 percent of residents are gun owners."},
    {"type" : "State", "id" : "20", "name" : "Kansas", "population" :  2885905, "score" : 47, "guns" : 1556, "rank" : 64, "traces" : 53.92, "stateSummary" : "Kansas enacted a Shall-Issue CCW law just a few years ago. Open carry is legal. The state’s Castle Doctrine covers defense of home, business or occupied vehicle. There are no restrictions on MSRs or magazine capacity."},
    {"type" : "State", "id" : "21", "name" : "Kentucky", "population" :  4380415, "score" : 48, "guns" : 2797, "rank" : 76, "traces" : 63.85, "stateSummary" : "Kentucky is a Shall-Issue CCW state with no permit needed for open carry, and its CCW law covers all deadly weapons—not just handguns. Kentucky has a Stand Your Ground law with no restrictions on MSRs or magazine capacity."},
    {"type" : "State", "id" : "22", "name" : "Louisiana", "population" :  4601893, "score" : 45, "guns" : 4709, "rank" : 100, "traces" : 102.33, "stateSummary" : "Louisiana is a Shall-Issue state for CCWs, and open carry is generally permitted. There are no restrictions on MSRs or magazine capacities. Residents have to get an NFA trust to obtain Class 3 weapons. Louisiana also has a Stand Your Ground law, and with 44 percent of the population in possession of firearms, the state ranks 13th in the nation in gun ownership."},
    {"type" : "State", "id" : "23", "name" : "Maine", "population" :  1329192, "score" : 42, "guns" : 432, "rank" : 38, "traces" : 32.50, "stateSummary" : "Maine is a Shall-Issue CCW state, and open carry is permitted in a vehicle only with a license. There are no restrictions on MSRs or magazine capacity. However, there are a lot of legal restrictions on the use of force inside one’s home, and the law is vague as to whether you have a duty to retreat. With 40.5 percent of the population in possession of firearms, Maine ranks 24th in gun ownership."},
    {"type" : "State", "id" : "24", "name" : "Maryland", "population" :  5884563, "score" : 21, "guns" : 3388, "rank" : 70, "traces" : 57.57, "stateSummary" : "Maryland is a May-Issue CCW state and has banned certain “assault pistols.” Magazines that hold more than 20 rounds can’t be manufactured or sold, but they can be possessed. Only handguns on the official register can be sold in the state, residents can only buy one gun a month, and Prince George County just banned gun shows. The state has a Castle Doctrine law, but invitees or guests may have a duty to retreat."},
    {"type" : "State", "id" : "25", "name" : "Massachusetts", "population" :  6646144, "score" : 8, "guns" : 511, "rank" : 6, "traces" : 7.69, "stateSummary" : "Massachusetts is no friend to gun owners. It is a May-Issue CCW state, and a state license is required for buying guns or ammunition. According to the NRA-ILA, “It is unlawful to sell, transfer, or possess ‘any assault weapon or a large capacity ammunition feeding device that was not otherwise lawfully possessed on September 13, 1994.’” All guns stored in the home have to be locked up. It has the third lowest percentage of gun owners of all 50 states; just 12.6 percent of residents own guns."},
    {"type" : "State", "id" : "26", "name" : "Michigan", "population" :  9883360, "score" : 40, "guns" : 2299, "rank" : 22, "traces" : 23.26, "stateSummary" : "Michigan is a Shall-Issue CCW state, and open carry is legal without a permit. As of December 2012, the state no longer requires a permit to purchase a handgun, according to the NRA-ILA. There are no restrictions on MSRs or magazine capacity. Machine guns and suppressors are (newly) legal, but short-barreled rifles are not."},
    {"type" : "State", "id" : "27", "name" : "Minnesota", "population" :  5379139, "score" : 34, "guns" : 1235, "rank" : 20, "traces" : 22.96, "stateSummary" : "Minnesota is a Shall-Issue CCW state, and a permit is required for carry. A permit is also required to purchase handguns or MSRs, but there are no magazine capacity restrictions. According to the NRA-ILA, “A person owning or possessing a machine gun or short-barreled shotgun shall, within ten (10) days after acquiring ownership or possession, file a written report with the Bureau of Criminal Apprehension showing his name, address, official title and position, if any, a full description of the arm, the purpose for which it is owned or possessed, and such further information as the Bureau may reasonably require.”"},
    {"type" : "State", "id" : "28", "name" : "Mississippi", "population" :  2984926, "score" : 45, "guns" : 2638, "rank" : 94, "traces" : 88.38, "stateSummary" : "Mississippi is a Shall-Issue state CCW state. The state has no restrictions on MSRs or magazine capacity. About 55 percent of the population owns guns, ranking Mississippi sixth in the nation in gun ownership."},
    {"type" : "State", "id" : "29", "name" : "Missouri", "population" :  6021988, "score" : 47, "guns" : 2531, "rank" : 54, "traces" : 42.03, "stateSummary" : "Missouri is a Shall-Issue CCW state. There are no restrictions on MSRs or magazine capacity. Missouri has no specific Stand Your Ground law, but the right of self-defense extends pretty much to all buildings and cars—even tents—and there is immunity from civil suits. A new bill was just introduced in the Missouri state legislature that would send lawmakers who introduce anti-gun legislation to prison, a week after a group of Democrats from St. Louis introduced an Assault Weapons Ban—which will get nowhere in the Republican-controlled state house."},
    {"type" : "State", "id" : "30", "name" : "Montana", "population" :  1005141, "score" : 46, "guns" : 343, "rank" : 42, "traces" : 34.12, "stateSummary" : "Montana is a Shall-Issue CCW state and recognizes CCWs from most other states. Open carry is legal. Montana has a Stand Your Ground law. In 2009, Montana lawmakers signed the Montana Firearms Freedom Act, which says that certain firearms and accessories made and sold within Montana are exempt from federal regulations, as they cannot be called interstate commerce. Montana has the third highest percentage of gun owners—57 percent—of any state in the Union."},
    {"type" : "State", "id" : "31", "name" : "Nebraska", "population" :  1855525, "score" : 40, "guns" : 729, "rank" : 50, "traces" : 39.29, "stateSummary" : "A Shall-Issue CCW state, Nebraska requires a permit to purchase a handgun. There are no restrictions on MSRs or magazine capacity, but they have very weak law regarding self-defense in the home. Nebraska places 28th in the nation with 38.6 percent of residents listed as gun owners."},
    {"type" : "State", "id" : "32", "name" : "Nevada", "population" :  2758931, "score" : 44, "guns" : 2105, "rank" : 84, "traces" : 76.30, "stateSummary" : "Nevada is a Shall-Issue CCW state, and requirements for CCW include shooting (qualifying). It has CCW reciprocity with 15 states, and open carry is generally legal. Nevada has laws protecting the confidentiality of CCW holders’ info, and there are no restrictions on MSRs or magazine capacity."},
    {"type" : "State", "id" : "33", "name" : "New Hampshire", "population" :  1320718, "score" : 47, "guns" : 297, "rank" : 18, "traces" : 22.49, "stateSummary" : "New Hampshire is a Shall-Issue CCW state. Open carry is legal without a permit—except in a vehicle—and the state has a new Stand Your Ground law, which was enacted in 2011. State legislators have spoken out against the president’s anti-gun proposals. There are no restrictions on MSRs or magazine capacity. New Hampshire ranks 39th in the nation in gun ownership with 30 percent of the population listed as gun owners."},
    {"type" : "State", "id" : "34", "name" : "New Jersey", "population" :  8864590, "score" : 7, "guns" : 481, "rank" : 4, "traces" : 5.43, "stateSummary" : "Don’t move to New Jersey if you like guns, or want to own/buy one. The state requires a Firearms Purchasers Identification Card for any firearm purchase, with a separate permit required for handguns. Magazines are limited to under 15 rounds, with only one handgun purchase allowed per permit. New Jersey is a May-Issue CCW state, but rarely issues them. MSRs could be grandfathered in, provided they were purchased before May 1, 1990, and registered before May 1 1991. Any MSR not owned before May 1, 1990, must be registered in the same manner as machine guns, and similar semi-auto rifles are not available today. Residents need a permit to buy ammo. NFA guns require a state license—good luck with that. For self-defense, retreat is required in many situations. For everybody who loves Repbulican Gov. Chris Christie, he has not even mentioned relaxing any of New Jersey’s gun laws. The state has the second lowest percentage of gun owners—12 percent—in the Union."},
    {"type" : "State", "id" : "35", "name" : "New Mexico", "population" :  2085538, "score" : 39, "guns" : 995, "rank" : 58, "traces" : 47.71, "stateSummary" : "While it is a Shall-Issue state, New Mexico requires completion of a 15-hour course and other strict licensing requirements before you can get a CCW. MSRs and Class 3 weapons that have been legally registered are legal. In regards to self-defense, the law is weak, with no protection from lawsuits."},
    {"type" : "State", "id" : "36", "name" : "New York", "population" :  19570261, "score" : 7, "guns" : 1914, "rank" : 8, "traces" : 9.78, "stateSummary" : "With its new state law, New York has become the most restrictive state in the nation on magazine capacity. Possession of MSRs is prohibited except for those grandfathered in. New York is a May-Issue CCW state; generally speaking, the closer you are to New York City, the less chance you have of getting one. Also, New York now has a weapons seizure law, just in case the cops think you might be up to something. 18 percent of New Yorkers are gun owners, ranking the state 45th in the nation."},
    {"type" : "State", "id" : "37", "name" : "North Carolina", "population" :  9752073, "score" : 45, "guns" : 7660, "rank" : 90, "traces" : 78.55, "stateSummary" : "North Carolina is a Shall-Issue CCW state. A state permit or CCW is required to purchase a handgun. There are no restrictions on MSRs or magazine capacity. North Carolina’s Castle Doctrine includes dwelling, workplace and vehicle."},
    {"type" : "State", "id" : "38", "name" : "North Dakota", "population" :  699628, "score" : 43, "guns" : 130, "rank" : 14, "traces" : 18.58, "stateSummary" : "North Dakota is a Shall-Issue CCW state with some minor restrictions. Open carry is legal only with a CCW. There are no restrictions on MSRs or magazine capacity. NFA firearms must be registered with the state Bureau of Criminal Investigation. North Dakota has laws in place protecting firearms manufacturers from suits in which an injury was suffered, unless there was a defect. 50.7 percent of residents are gun owners, ranking North Dakota 10th in the nation."},
    {"type" : "State", "id" : "39", "name" : "Ohio", "population" :  11544225, "score" : 40, "guns" : 7005, "rank" : 72, "traces" : 60.68, "stateSummary" : "Ohio is a Shall-Issue CCW state that requires 12 hours of training before a CCW can be obtained. Open carry is legal except in a vehicle. Ohio has reciprocity with at least 23 other states. There are no other restrictions on MSRs or magazine capacity. Ohio’s Castle Doctrine law extends to vehicles of self and immediate family."},
    {"type" : "State", "id" : "40", "name" : "Oklahoma", "population" :  3814820, "score" : 41, "guns" : 1277, "rank" : 40, "traces" : 33.47, "stateSummary" : "Oklahoma is a Shall-Issue CCW state with training requirements. The state has reciprocity with just about every state that issues CCWs. There are no restrictions on MSRs or magazine capacity. According to the NRA-ILA, “It is unlawful to possess, purchase, or sell a machine gun, except in compliance with all federal laws and regulations. It is unlawful to possess a sawed-off shotgun or rifle without a federal license.”"},
    {"type" : "State", "id" : "41", "name" : "Oregon", "population" :  3899353, "score" : 42, "guns" : 2090, "rank" : 62, "traces" : 53.60, "stateSummary" : "Oregon is a Shall-Issue CCW state with very few restrictions on where guns can be carried, but with no reciprocity. There are no restrictions on MSRs or magazine capacity. In addition, 40 percent of residents are gun owners, placing Oregon 26th in the nation in gun ownership."},
    {"type" : "State", "id" : "42", "name" : "Pennsylvania", "population" :  12763536, "score" : 45, "guns" : 6545, "rank" : 60, "traces" : 51.28, "stateSummary" : "Pennsylvania is a Shall-Issue state for LTF (License to Carry) firearms, which is also available for non-residents. Pennsylvania has CCW reciprocity with 27 states, and there are no restrictions on MSRs or magazine capacity. In addition, 34.7 percent of residents are gun owners, placing Pennsylvania 33rd in the nation in gun ownership."},
    {"type" : "State", "id" : "43", "name" : "<Empty>", "population" :  0, "score" : 0, "guns" : 0, "rank" : 0, "traces" : 0, "stateSummary" : ""},
    {"type" : "State", "id" : "44", "name" : "Rhode Island", "population" :  1050292, "score" : 22, "guns" : 140, "rank" : 12, "traces" : 13.33, "stateSummary" : "Rhode Island is (in effect) a May-Issue CCW state, but most jurisdictions won’t issue them without a specific “need.” All buyers must first pass a state safety exam. Rhode Island’s Castle Doctrine is limited to the inside of a dwelling or a chicken coop, with no duty to retreat. NFA weapons not allowed, but there are no restrictions on MSRs or magazine capacity. In addition, 12.8 percent of residents are gun owners, placing Rhode Island 47th in the nation in gun ownership."},
    {"type" : "State", "id" : "45", "name" : "South Carolina", "population" :  4723723, "score" : 46, "guns" : 3619, "rank" : 86, "traces" : 76.61, "stateSummary" : "South Carolina is a Shall-Issue CCW state. South Carolina has no restrictions on MSRs or magazine capacity. The state’s Stand Your Ground law was recently enacted. In addition, 42 percent of residents are gun owners, ranking South Carolina 18th in the nation."},
    {"type" : "State", "id" : "46", "name" : "South Dakota", "population" :  833354, "score" : 42, "guns" : 156, "rank" : 16, "traces" : 18.72, "stateSummary" : "South Dakota is a Shall-Issue state with very few restrictions. South Dakota recognizes valid CCWs from every state. Laws have been passed ensuring firearms makers, distributors and sellers are not liable for any injury caused by the use of firearms. The state have no specific Castle Doctrine. In addition, 56.6 percent of residents are gun owners, placing South Dakota fourth in the nation."},
    {"type" : "State", "id" : "47", "name" : "Tennessee", "population" :  6456243, "score" : 44, "guns" : 3676, "rank" : 68, "traces" : 56.94, "stateSummary" : "Tennessee is a Shall-Issue CCW state with a number of restrictions on where you can’t carry. There are no restrictions on MSRs or magazine capacity. Residents have no duty to retreat before using deadly force—as long as they’re acting lawfully and allowed to be where they are. Some cities with existing laws can preempt state law."},
    {"type" : "State", "id" : "48", "name" : "Texas", "population" :  26059203, "score" : 45, "guns" : 10321, "rank" : 52, "traces" : 39.61, "stateSummary" : "A Shall-Issue CCW state, Texas recognizes permits from 41 states. No open carry is allowed. There are no restrictions on MSRs or magazine capacity. Texas has a Stand Your Ground law for vehicles or workplaces with no duty to retreat, and immunity from civil lawsuits. Texas is known as a very pro-gun state, but only ranked 30th in the nation with gun owners making up 36 percent of the population."},
    {"type" : "State", "id" : "49", "name" : "Utah", "population" :  2855287, "score" : 48, "guns" : 868, "rank" : 34, "traces" : 30.40, "stateSummary" : "Utah is very quietly a very pro-gun state. It is a Shall-Issue CCW state. Utah honors all CCW permits except Vermont, and you can get a non-resident CCW. Utah CCWs are recognized in 34 states. Utah is also a Stand Your Ground state with no restriction on location. Private sales are legal. In addition, 44 percent of residents are gun owners, placing Utah 14th in the nation in gun ownership."},
    {"type" : "State", "id" : "50", "name" : "Vermont", "population" :  626011, "score" : 49, "guns" : 160, "rank" : 24, "traces" : 25.56, "stateSummary" : "Residents or visitors may carry open or concealed without a permit—the Vermont Constitution predates the U.S. Bill of Rights. There are no restrictions on MSRs or magazine capacity. Vermont has no specific laws about Castle Doctrine, which is the only reason Vermont didn’t score a perfect 50."},
    {"type" : "State", "id" : "51", "name" : "Virginia", "population" :  8185867, "score" : 44, "guns" : 6375, "rank" : 88, "traces" : 77.88, "stateSummary" : "A Shall-Issue CCW state, Virginia has reciprocity or agreements to honor CCWs of 27 states. There is no requirement to notify law enforcement you’re carrying, and open carry is generally legal. Semi-automatic shotguns with folding stocks and 12-round magazines are prohibited, but there are no other restrictions on MSRs or magazine capacity. NFA firearms must be registered with the State Police."},
    {"type" : "State", "id" : "52", "name" : "<Empty>", "population" :  0, "score" : 0, "guns" : 0, "rank" : 0, "traces" : 0, "stateSummary" : ""},
    {"type" : "State", "id" : "53", "name" : "Washington", "population" :  6897012, "score" : 34, "guns" : 2412, "rank" : 44, "traces" : 34.97, "stateSummary" : "Washington is a Shall-Issue CCW state, with a long list of places where possession or storage of ammunition and firearms is prohibited. According to the NRA-ILA, “A person shall not carry or place a loaded pistol in any vehicle unless he has a license to carry a concealed weapon and the pistol is on his person, or the person with the concealed carrying license is within the vehicle at all times that the pistol is there, or the person with the concealed carrying license is away from the vehicle and the pistol is locked within the vehicle and concealed from view from outside the vehicle.”  Washington has CCW reciprocity with 12 states, but only recognizes Class 1 permits from North Dakota. There are no restrictions on MSRs or magazine capacity. For Class 3 weapons, suppressors are legal, and machine guns are allowed for anyone who possesses a National Firearms Tax Stamp and who produce, manufacture or test machine guns. A restrictive MSR bill was recently introduced into the state legislature, but then withdrawn after complaints—it allowed for police searches of homes to verify compliance. In addition, 33.1 percent of residents are gun owners."},
    {"type" : "State", "id" : "54", "name" : "West Virginia", "population" :  1855413, "score" : 45, "guns" : 1144, "rank" : 74, "traces" : 61.66, "stateSummary" : "A Shall-Issue CCW state, West Virginia requires no permit to purchase, and private sales are legal. There are no restrictions on MSRs or magazine capacity. West Virginia’s Castle Doctrine law was enacted in 2008. In addition, 55 percent of residents are gun owners, placing West Virginia fifth in the nation in gun ownership."},
    {"type" : "State", "id" : "55", "name" : "Wisconsin", "population" :  5726398, "score" : 42, "guns" : 2066, "rank" : 46, "traces" : 36.08, "stateSummary" : "In Wisconsin, there is a 48-hour waiting period on handgun purchases. As of 2011, the state has concealed carry with no duty to inform, but no carry on some city buses. Machine guns are not legal to own. The NRA-ILA describes the legality of short-barreled rifles and suppressors as “a state of flux and clarification,” adding legislators are seeking reform. Wisconsin has a Castle Doctrine/Stand Your Ground law with immunity from prosecution. Gov. Scott Walker has been fighting an uphill battle for gun rights in the state for the last few years."},
    {"type" : "State", "id" : "56", "name" : "Wyoming", "population" :  576412, "score" : 47, "guns" : 152, "rank" : 26, "traces" : 26.37, "stateSummary" : "Wyoming residents can carry concealed or open, and Wyoming recognizes CCWs from 33 states. The state has Castle Doctrine and Stand Your Ground laws for inside the home, but the law does not excuse you from a duty to retreat outside the home. Wyoming has the highest percentage of gun owners per capita—60 percent—of any state."}
]}